{
  "projects": [
    {
      "id": 1,
      "title": "PD Silent Auction",
      "preview": "Whamo! That&apos;s a pretty catchy first word if you ask me. How does it relate to\n            this project you ask? Hmmmm...it doesn&apos;t!",
      "body": "So you&apos;ve come to the second paragraph I see. Well in that case, I&apos;ll tell\n            you a little bit about this project. A friend of mine runs a local\n            organization called  Project Downtown Gainesville. They\n            help put together meals for the homeless every week. Every year though,\n            they have a banquet where they have both a live and a silent auction.\n            Typically the silent auction happens on paper, however, my friend had\n            the idea of hosting it on the internet because of COVID and recruited\n            me to make it.\n            <br />\n            <br />\n            Initially, I was going to create an app using Vue, Node, Express, and Mongo. After\n            putting together a basic frontend using Vue, Vue router, and Vuetify, I started\n            working on the authentication, which I used firebase for. After getting that set up\n            I decided I would give firestore a chance and went with that for my backend. It made\n            getting the app up and running much quicker and it also scaled extremely well. After\n            getting all that working I went ahead and deployed it using Netlify.\n            <br />\n            <br />\n            On the day of the auction, the app worked flawlessly! Firebase registered\n            over 110,000 reads during just the evening of the event. My web app was\n            able to help increase the amount the silent auction brought in by opening\n            it up to the online public.\n            Cool Beans!\n            <br />\n            <br />\n            Also, this website should be live at pdsilent.org"
    },
    {
      "id": 2,
      "title": "Project 2",
      "preview": "wee weee",
      "body": "woo woo"
    }
  ]
}