{
  "ramblings": [
    {
      "id": 1,
      "title": "Ramble 1.0",
      "preview": "Once upon a time, there was a member of the bourgeoisie. It was a young man. A mysterious one to be sure...",
      "body": "His eyes glistened as he focused his gaze upon the noble Bob. \"Bob\" he exclaimed! What had Bob done this time. One would hope it was not a repeat of the horseshoe incident...lest we want another war that is. No, this seemed milder. It must've been something to do with last week's festival. Yes, it must've been.           Just a week ago, Master Klingon decided to host a festival in honorof his son's recent graduation from the cycling academy. Fireworks,arcade machines, and best of all, free computational devices for allinvited. It was the real deal, as is commonly said. Seemingly,any time there is joy to be had, Bob gravitates towards preventingit. This festival was no different. Bam! The..."
    },
    {
      "id": 2,
      "title": "Ramble 2.0",
      "preview": "Bam! The dust became unsettled. What had just precipitated was like nothing before, and likely nothing after. The computational devices became animated, as if they were filled with rage and angst. They caused trembles to coarse through the floors and shook the foundations of the palace as they arose. They scanned their surrounding with their hollowing screens and took note of everyone’s location.",
      "body": "Oddly, and one should say... unsurprisingly, they seemed to focus on Bob. The 11 or so computers decided to focus their computes on him. One after the other, another compute was completed, further enhancing the machines' understanding of Bob. Once he realized what was beginning to take place he tried an elaborate ruse to bring their attention to our mysterious protagonist, Pip. He began with throwing things towards Pip, then following it up with claims that Pip was intent on hurting the computational devices. Unfortunately, his plan had worked. Bzzz, pop, fizz! They clamored their way to height to get a better vantage of Pip. \"Watch out!\"..."
    },
    {
      "id": 3,
      "title": "Ramble 3.0",
      "preview": "\"Watch out!\" shouted Pip's father, Cromulues the fifth. In the blink of an eye, Pip had been knocked unconscious by a compute bomb. Gasps echoed in the halls. Shock. Then anger. Panic. If the commotion caused by the computers could be compared to an earthquake, Pip's collapse caused a supervolcano of a reaction.",
      "body": "Clink. Clank. The computational devices crept towards Pip in an eccentric manner.  Still, no one had any clue why they had become animated, and what they wanted with  Pip. They formed something of a circle around the dazed Pip and began converging on  him. Uh oh. This looked bad. Really bad. What was next? Where they about to end  Pip's life right then and there?   As they grew closer to pip, they obscured everyone’s view. A light grew from  within their circle. Not quite pink but not quite green. It grew in intensity  until no one could keep their eyes open any longer. In a flash, they were gone.  Pip too.   In the corner, Master Klingon's son, Rowser sneered as everyone else had become  pale from the events that had just occurred. Cromulues noticed and became infuriated.  How dare someone sneer just as his son had gone missing. Enraged, he made his  way towards Rowser. \"Why are you smiling! Is this some sort of ploy!?!\" exclaimed  Cromulues. Rowser retorted \"Why so sad old man. I did us all a favor.\"   A knife? Yes! A knife. Cromulues had grabbed a knife and ..."
    }
  ]
}